blog/technology-radar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Thought works 技术雷达</title>
<!-- 2020-01-07 Tue 08:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Thought works 技术雷达</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 技术</a></li>
</ul>
</div>
</div>
<p>
link: <a href="https://assets.thoughtworks.com/assets/technology-radar-vol-21-cn.pdf">https://assets.thoughtworks.com/assets/technology-radar-vol-21-cn.pdf</a>
</p>

<ul class="org-ul">
<li>云：多即是少？
</li>
<li>保护软件供应链
</li>
<li>打开机器学习的黑匣子。在选择机器学习模型时，将可解释性视为第一要务。
</li>
<li>软件开发是一项团队运动。不提倡 <b><b>10倍工程师</b></b> 的理念，应专注创建和赋能 **10倍团队**。
</li>
</ul>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 技术</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Container security scanning  容器的安全扫描
</li>
<li>Data integrity at the origin 数据在源头的准确性
</li>
<li>Micro frontends 微前端
</li>
<li>Pipelines for infrastructure as code 使用流水线基础架构作为代码开发中的一环。
</li>
</ul>

<p>
CI/CD工具能够被用来测试服务器的配置（如Chef cookbooks，Puppet modules和Ansible playbooks），服务器的镜像构建（如Packer），环境的生成（如Terraform，CloudFormation）和环境间的集成。将流水线用于基础设施即代码，可以让你在变更应用于运行环境（包括开发和测试环境）之前就发现错误。
</p>

<ul class="org-ul">
<li>Run cost as an architecture fitness function 
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>